esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS2Host.cpp
/*
    clsLEAmDNS2_Host::_installServiceQuery

*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::_installServiceQuery(
    const char* p_pcService,
    const char* p_pcProtocol)
{
    clsQuery*   pMDNSQuery = 0;

    if ((p_pcService) && (*p_pcService) &&
            (p_pcProtocol) && (*p_pcProtocol) &&
            ((pMDNSQuery = _allocQuery(clsQuery::enuQueryType::Service))) &&
            (_buildDomainForService(p_pcService, p_pcProtocol, pMDNSQuery->m_Domain)))
    {
        pMDNSQuery->m_bStaticQuery = false;

        if (_sendQuery(*pMDNSQuery))
        {
            pMDNSQuery->m_u32SentCount = 1;
            pMDNSQuery->m_ResendTimeout.reset(clsConsts::u32DynamicQueryResendDelay);
        }
        else
        {
            _removeQuery(pMDNSQuery);
        }
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _installServiceQuery: %s for '_%s._%s.local'!\n\n"), _DH(), (pMDNSQuery ? "Succeeded" : "FAILED"), (p_pcService ? : "-"), (p_pcProtocol ? : "-")););
    DEBUG_EX_ERR(if (!pMDNSQuery) DEBUG_OUTPUT.printf_P(PSTR("%s _installServiceQuery: FAILED for '_%s._%s.local'!\n\n"), _DH(), (p_pcService ? : "-"), (p_pcProtocol ? : "-")););
    return pMDNSQuery;
}

/*
    clsLEAmDNS2_Host::_installDomainQuery
*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::_installDomainQuery(
    clsLEAMDNSHost::clsRRDomain & p_Domain,
    clsLEAMDNSHost::clsQuery::enuQueryType p_QueryType)
{
    clsQuery*    pQuery = 0;

    if ((pQuery = _allocQuery(p_QueryType)))
    {
        pQuery->m_Domain = p_Domain;
        pQuery->m_bStaticQuery = false;

        if (_sendQuery(*pQuery))
        {
            pQuery->m_u32SentCount = 1;
            pQuery->m_ResendTimeout.reset(clsConsts::u32DynamicQueryResendDelay);
        }
        else
        {
            _removeQuery(pQuery);
        }
    }
    DEBUG_EX_INFO(
        DEBUG_OUTPUT.printf_P(PSTR("%s _installDomainQuery: %s for "), (pQuery ? "Succeeded" : "FAILED"), _DH());
        _printRRDomain(p_Domain);
        DEBUG_OUTPUT.println();
    );
    DEBUG_EX_ERR_IF(!pQuery,
                    DEBUG_OUTPUT.printf_P(PSTR("%s _installDomainQuery: FAILED for "), _DH());
                    _printRRDomain(p_Domain);
                    DEBUG_OUTPUT.println());
    return pQuery;
}

/*
    clsLEAmDNS2_Host::_hasQueriesWaitingForAnswers
*/
bool clsLEAMDNSHost::_hasQueriesWaitingForAnswers(void) const
{
    bool    bOpenQueries = false;

    for (const clsQuery* pQuery : m_Queries)
    {
        if (pQuery->m_bAwaitingAnswers)
        {
            bOpenQueries = true;
            break;
        }
    }
    return bOpenQueries;
}

/*
    clsLEAmDNS2_Host::_executeQueryCallback
*/
bool clsLEAMDNSHost::_executeQueryCallback(const clsQuery & p_Query,
        const clsQuery::clsAnswer & p_Answer,
        clsQuery::clsAnswer::typeQueryAnswerType p_QueryAnswerTypeFlags,
        bool p_bSetContent)
{
    if (p_Query.m_fnCallbackAnswer)
    {
        p_Query.m_fnCallbackAnswer(p_Query, p_Answer, p_QueryAnswerTypeFlags, p_bSetContent);
    }
    if (p_Query.m_fnCallbackAccessor)
    {
        p_Query.m_fnCallbackAccessor(p_Query, clsQuery::clsAnswerAccessor(&p_Answer), p_QueryAnswerTypeFlags, p_bSetContent);
    }
    return true;
}


}   // namespace MDNSImplementation


}   // namespace esp8266




